{
  "architectures": ["LlamaForCausalLM"],
  "model_type": "llama",
  "hidden_size": 4096,
  "intermediate_size": 11008,
  "num_hidden_layers": 32,
  "num_attention_heads": 32,
  "num_key_value_heads": 32,
  "vocab_size": 32000,
  "max_position_embeddings": 4096,
  "rms_norm_eps": 1e-05,
  "rope_theta": 10000.0,
  "hidden_act": "silu",
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.44.0"
}
