{
  "architectures": ["DeepseekV3ForCausalLM"],
  "model_type": "deepseek_v3",
  "hidden_size": 7168,
  "intermediate_size": 18432,
  "moe_intermediate_size": 2048,
  "num_hidden_layers": 61,
  "num_attention_heads": 128,
  "num_key_value_heads": 128,
  "n_routed_experts": 256,
  "n_shared_experts": 1,
  "num_experts_per_tok": 8,
  "kv_lora_rank": 512,
  "q_lora_rank": 1536,
  "qk_nope_head_dim": 128,
  "qk_rope_head_dim": 64,
  "v_head_dim": 128,
  "vocab_size": 129280,
  "max_position_embeddings": 163840,
  "rms_norm_eps": 1e-06,
  "hidden_act": "silu",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.46.3"
}
